一
丁
七
丅
万
丈
三
上
下
不
与
丏
丐
丑
专
且
丕
世
丘
丙
业
丛
东
丝
丞
丟
丠
丢
两
严
並
丧
丨
个
丫
中
丰
串
临
丶
丸
丹
为
主
丽
举
乃
久
么
义
之
乌
乍
乎
乏
乐
乒
乓
乔
乖
乘
乙
乛
乜
九
乞
也
习
乡
书
买
乱
乳
乾
亀
亂
了
予
争
事
二
亍
于
亏
云
互
亓
五
井
亘
亚
些
亜
亞
亟
亡
亢
交
亥
亦
产
亨
亩
享
京
亭
亮
亲
亳
亵
人
亻
亿
什
仁
仂
仃
仄
仅
仆
仇
仉
今
介
仍
从
仑
仓
仔
仕
他
仗
付
仙
仝
仞
仟
仡
代
令
以
仨
仪
仫
们
仰
仲
仳
件
价
任
份
仿
企
伉
伊
伍
伎
伏
伐
休
众
优
伙
会
伛
伞
伟
传
伢
伤
伥
伦
伧
伪
伫
伯
估
伴
伶
伸
伺
似
伽
佃
但
佇
佈
位
低
住
佐
佑
体
佔
何
佗
佘
余
佚
佛
作
佝
佞
佟
你
佡
佢
佣
佤
佥
佩
佬
佯
佰
佳
佴
佶
佺
佻
佼
佾
使
侃
侄
來
侈
侉
例
侍
侏
侑
侔
侖
侗
供
依
侠
侣
侥
侦
侧
侨
侩
侪
侬
侮
侯
侵
侶
便
俁
係
促
俄
俊
俎
俏
俐
俑
俗
俘
俚
保
俞
俟
俠
信
俣
俦
俨
俩
俪
俭
修
俯
俱
俳
俶
俸
俺
俾
倀
倆
倉
個
倌
倍
倏
們
倒
倔
倘
候
倚
倜
倞
借
倡
倥
倦
倨
倩
倪
倫
倬
倭
倶
债
值
倾
偃
假
偈
偉
偌
偎
偏
偕
做
停
健
偬
偲
側
偵
偶
偷
偻
偾
偿
傀
傅
傈
傍
傑
傖
傘
備
傣
傥
傧
储
傩
催
傭
傯
傲
傳
傴
債
傷
傻
傾
僂
僅
僉
像
僑
僕
僖
僚
僞
僥
僦
僧
僨
僭
僱
僳
僵
價
僻
儀
儂
億
儆
儇
儈
儉
儋
儐
儒
儔
儕
償
儡
優
儲
儷
儺
儻
儼
儿
兀
允
元
兄
充
兆
先
光
克
兌
免
児
兑
兒
兔
兖
兗
党
兜
兢
入
內
全
兩
八
公
六
兮
兰
共
关
兴
兵
其
具
典
兹
养
兼
兽
冀
内
円
冇
冈
冉
冊
册
再
冒
冕
冗
写
军
农
冠
冢
冤
冥
冨
冪
冬
冮
冯
冰
冲
决
况
冶
冷
冻
冼
冽
净
凄
准
凇
凉
凋
凌
凍
减
凑
凛
凜
凝
几
凡
凤
凫
凭
凯
凰
凱
凳
凶
凸
凹
出
击
函
凿
刀
刁
刃
分
切
刈
刊
刍
刎
刑
划
刖
列
刘
则
刚
创
初
删
判
別
刨
利
刪
别
刭
刮
到
刳
制
刷
券
刹
刺
刻
刽
剁
剂
剃
剄
則
削
剌
前
剎
剐
剑
剔
剖
剛
剜
剝
剡
剣
剥
剧
剩
剪
剮
副
割
創
剽
剿
劁
劃
劇
劈
劉
劊
劍
劐
劑
劓
力
劝
办
功
加
务
劢
劣
动
助
努
劫
劭
励
劲
劳
劵
劼
劾
势
勁
勃
勇
勉
勋
勍
勐
勒
動
勖
勘
務
勛
勝
勞
募
勢
勤
勰
勱
勵
勸
勺
勻
勾
勿
匀
包
匆
匈
匍
匐
匕
化
北
匙
匝
匠
匡
匣
匦
匪
匭
匮
匯
匱
匹
区
医
匾
匿
區
十
千
卅
升
午
卉
半
华
协
卑
卒
卓
協
单
卖
南
博
卜
卞
卟
占
卡
卢
卤
卦
卧
卫
卮
卯
印
危
即
却
卵
卷
卸
卺
卻
卿
厂
厄
厅
历
厉
压
厌
厕
厘
厚
厝
原
厢
厣
厥
厦
厨
厩
厭
厮
厲
厴
去
县
叁
参
參
叄
又
叉
及
友
双
反
収
叐
发
叒
叔
叕
取
受
变
叙
叛
叟
叠
叢
口
古
句
另
叨
叩
只
叫
召
叭
叮
可
台
叱
史
右
叵
叶
号
司
叹
叻
叼
叽
吁
吃
各
吆
合
吉
吊
吋
同
名
后
吏
吐
向
吒
吓
吕
吖
吗
君
吝
吞
吟
吠
吡
吣
否
吧
吨
吩
含
听
吭
吮
启
吱
吳
吴
吵
吶
吸
吹
吻
吼
吾
呀
呂
呃
呆
呈
呉
告
呋
呎
呐
呓
呔
呕
呖
呗
员
呛
呜
呢
呤
呦
周
呱
呲
味
呵
呶
呷
呸
呻
呼
命
咀
咁
咂
咄
咆
咋
和
咎
咏
咐
咒
咔
咕
咖
咘
咙
咚
咛
咝
咣
咤
咥
咦
咧
咨
咩
咪
咫
咬
咯
咱
咲
咳
咴
咸
咻
咽
咾
咿
哀
品
哂
哄
哆
哇
哈
哉
响
哎
哏
哐
哑
哒
哓
哔
哕
哗
哙
哝
哞
哟
員
哥
哦
哧
哨
哩
哪
哭
哮
哲
哺
哼
哽
唁
唄
唆
唇
唉
唏
唐
唑
唔
唚
唛
唠
唢
唤
唧
唪
唬
售
唯
唰
唱
唳
唷
唾
唿
啃
啄
商
啈
啉
啊
問
啐
啓
啕
啖
啜
啞
啟
啡
啤
啥
啦
啧
啪
啫
啬
啭
啮
啰
啵
啶
啷
啸
啻
啼
啾
喀
喁
喂
喃
善
喆
喇
喉
喊
喋
喏
喑
喔
喘
喙
喚
喜
喝
喟
喧
喪
喬
單
喰
喱
喲
喳
喵
営
喷
喹
喻
喽
喾
嗅
嗆
嗇
嗉
嗍
嗎
嗑
嗒
嗓
嗔
嗖
嗚
嗜
嗝
嗟
嗡
嗣
嗤
嗥
嗦
嗨
嗩
嗪
嗬
嗯
嗲
嗳
嗵
嗶
嗷
嗽
嗾
嘀
嘁
嘅
嘆
嘈
嘉
嘌
嘍
嘎
嘔
嘖
嘗
嘘
嘚
嘛
嘜
嘞
嘟
嘡
嘢
嘣
嘤
嘩
嘬
嘭
嘮
嘯
嘰
嘱
嘲
嘴
嘵
嘶
嘹
嘻
嘿
噁
噌
噍
噎
噓
噔
噗
噘
噙
噜
噝
噠
噢
噤
噥
噦
器
噩
噪
噬
噯
噱
噲
噴
噶
噸
噻
噼
嚀
嚇
嚎
嚏
嚒
嚓
嚕
嚣
嚦
嚨
嚯
嚳
嚴
嚶
嚷
嚼
囀
囂
囈
囉
囊
囑
囔
囖
囗
囚
四
囝
回
囟
因
囡
团
囤
囧
囪
囫
园
困
囱
図
围
囵
囹
固
国
图
囿
圃
圄
圆
圇
圈
國
圍
園
圓
圖
團
圜
土
圣
在
圩
圪
圬
圭
圮
圯
地
圳
圹
场
圻
圾
址
坂
坆
均
坊
坌
坍
坎
坏
坐
坑
块
坚
坛
坜
坝
坞
坟
坠
坡
坤
坦
坨
坩
坪
坯
坳
坷
坻
坼
垂
垃
垄
垅
垆
型
垌
垒
垓
垚
垛
垟
垠
垡
垢
垣
垦
垧
垩
垫
垭
垮
垯
垵
垸
埂
埃
埇
埋
埌
城
埒
埔
埕
埘
埙
埚
埝
域
埠
埡
埤
埭
埴
執
埸
培
基
埼
埽
堀
堂
堃
堅
堆
堇
堊
堋
堍
堑
堕
堝
堞
堡
堤
堪
堯
堰
報
場
堵
堺
塄
塅
塊
塋
塌
塍
塑
塒
塔
塗
塘
塚
塞
塢
塤
填
塬
塱
塵
塹
塾
墀
墁
境
墅
墉
墊
墒
墓
墘
墙
墚
墜
增
墟
墨
墩
墮
墳
墶
墻
墾
壁
壅
壇
壑
壓
壕
壘
壙
壚
壞
壟
壠
壢
壤
壩
士
壬
壮
壯
声
壳
壶
壹
壺
壽
处
备
复
夏
夔
夕
外
夙
多
夜
够
夠
夢
夤
夥
大
天
太
夫
夭
央
夯
失
头
夷
夸
夹
夺
夾
奁
奂
奄
奇
奈
奉
奋
奎
奏
奐
契
奔
奕
奖
套
奘
奚
奠
奢
奥
奧
奩
奪
奭
奮
女
奴
奶
奸
她
奼
好
妁
如
妃
妄
妆
妇
妈
妊
妍
妒
妓
妖
妗
妙
妝
妞
妣
妤
妥
妨
妩
妪
妮
妯
妲
妳
妹
妻
妾
姆
姊
始
姍
姐
姑
姒
姓
委
姗
姘
姚
姜
姝
姣
姥
姨
姫
姬
姵
姹
姻
姿
威
娃
娄
娅
娆
娇
娉
娌
娑
娓
娘
娛
娜
娟
娠
娣
娥
娩
娭
娱
娲
娴
娶
娼
婀
婁
婆
婉
婊
婕
婚
婢
婦
婧
婪
婭
婴
婵
婶
婷
婺
婿
媌
媒
媚
媛
媜
媧
媪
媲
媳
媼
媽
媾
嫁
嫂
嫃
嫉
嫌
嫑
嫔
嫖
嫗
嫚
嫜
嫡
嫣
嫦
嫩
嫱
嫵
嫻
嬅
嬈
嬉
嬋
嬌
嬖
嬗
嬙
嬛
嬤
嬪
嬰
嬲
嬴
嬷
嬸
孀
子
孑
孓
孔
孕
字
存
孙
孚
孛
孜
孝
孟
孢
季
孤
孥
学
孨
孩
孪
孫
孬
孮
孰
孱
孳
孵
學
孺
孽
孿
宁
它
宄
宅
宇
守
安
宋
完
宏
宓
宔
宕
宗
官
宙
定
宛
宜
宝
实
実
宠
审
客
宣
室
宥
宦
宪
宫
宮
宰
害
宴
宵
家
宸
容
宽
宾
宿
寂
寄
寅
密
寇
富
寐
寒
寓
寛
寝
寞
察
寡
寢
寤
寥
實
寧
寨
審
寫
寬
寮
寰
寳
寵
寶
寸
对
寺
寻
导
寿
封
射
尅
将
將
專
尉
尊
尋
對
導
小
尐
少
尒
尓
尔
尕
尖
尘
尚
尛
尝
尤
尥
尧
尨
尬
就
尴
尷
尸
尹
尺
尻
尼
尽
尾
尿
局
屁
层
居
屆
屈
屉
届
屋
屌
屍
屎
屏
屐
屑
展
屙
屜
属
屠
屡
屢
屣
層
履
屦
屨
屬
屮
屯
山
屹
屿
岀
岁
岂
岌
岐
岑
岔
岖
岗
岘
岙
岚
岛
岡
岢
岩
岫
岬
岭
岱
岳
岷
岸
岿
峇
峋
峒
峔
峘
峙
峡
峤
峥
峦
峨
峪
峭
峯
峰
峴
島
峻
峽
崀
崂
崃
崆
崇
崍
崎
崔
崖
崗
崙
崚
崛
崢
崧
崩
崭
崮
崴
崽
嵇
嵊
嵋
嵌
嵐
嵘
嵛
嵩
嵬
嵯
嵴
嶂
嶄
嶇
嶋
嶗
嶙
嶝
嶠
嶴
嶸
嶺
嶼
巅
巋
巍
巒
巔
川
州
巡
巢
工
左
巧
巨
巩
巫
差
巯
巰
己
已
巳
巴
巷
巹
巻
巾
巿
币
市
布
帅
帆
师
希
帐
帑
帔
帕
帖
帘
帙
帚
帛
帜
帝
帥
带
帧
師
席
帮
帰
帱
帳
帶
帷
常
帻
帼
帽
幀
幂
幄
幅
幌
幔
幕
幗
幘
幛
幟
幡
幢
幣
幫
幬
干
平
年
并
幸
幺
幻
幼
幽
幾
广
広
庄
庆
庇
床
序
庐
庑
库
应
底
庖
店
庙
庚
府
庞
废
庥
度
座
庫
庭
庵
庶
康
庸
庹
庾
廁
廂
廄
廈
廉
廊
廋
廓
廖
廚
廝
廟
廠
廡
廢
廣
廨
廩
廪
廬
廳
延
廷
建
廿
开
弁
异
弃
弄
弈
弊
弋
弎
式
弑
弒
弓
引
弗
弘
弛
弟
张
弢
弥
弦
弧
弩
弭
弯
弱
張
強
弹
强
弼
彀
彈
彊
彌
彎
归
当
录
彗
彝
形
彤
彥
彦
彩
彪
彬
彭
彰
影
彳
彷
役
彻
彼
彿
往
征
徂
径
待
徇
很
徉
徊
律
後
徐
徑
徒
徕
得
徘
徙
徜
從
徠
御
徨
復
循
徬
徭
微
徳
德
徹
徽
心
必
忆
忌
忍
忏
忐
忑
忒
忖
志
忘
忙
忝
忠
忡
忤
忧
忪
快
忱
念
忸
忻
忽
忾
忿
怀
态
怂
怄
怅
怆
怍
怎
怏
怒
怔
怕
怖
怙
怜
思
怠
怡
急
怦
性
怨
怩
怪
怯
怵
总
怼
怿
恁
恂
恃
恆
恋
恍
恐
恒
恕
恙
恚
恝
恢
恣
恤
恥
恧
恨
恩
恪
恫
恬
恭
息
恰
恳
恵
恶
恸
恹
恺
恻
恼
恽
恿
悃
悄
悅
悉
悌
悍
悒
悔
悖
悚
悛
悟
悠
患
悦
您
悫
悬
悭
悯
悱
悲
悴
悵
悶
悸
悻
悼
情
惆
惊
惋
惑
惕
惘
惚
惜
惟
惠
惡
惦
惧
惨
惩
惫
惬
惭
惮
惯
惰
惱
惲
想
惴
惶
惹
惺
惻
愀
愁
愆
愈
愉
愎
意
愕
愚
愛
愜
感
愠
愣
愤
愧
愨
愫
愴
愷
愾
愿
慈
態
慌
慍
慎
慑
慕
慘
慚
慜
慟
慢
慣
慧
慨
慪
慫
慮
慰
慳
慵
慶
慷
憂
憊
憋
憎
憐
憑
憔
憚
憤
憧
憨
憩
憫
憬
憲
憶
憷
憾
懂
懇
懈
應
懊
懋
懌
懍
懑
懒
懔
懟
懣
懦
懨
懲
懵
懶
懷
懸
懺
懼
懾
懿
戀
戆
戇
戈
戉
戊
戌
戍
戎
戏
成
我
戒
戕
或
戗
战
戚
戛
戟
戡
戥
戧
戩
截
戬
戮
戰
戲
戳
戴
戶
户
戸
戽
戾
房
所
扁
扃
扇
扈
扉
手
才
扎
扑
扒
打
扔
托
扙
扛
扞
扣
扦
执
扩
扪
扫
扬
扭
扮
扯
扰
扳
扶
批
扼
找
承
技
抄
抆
抉
把
抑
抒
抓
抔
投
抖
抗
折
抚
抛
抠
抡
抢
护
报
抨
披
抬
抱
抵
抹
抻
押
抽
抿
拂
拄
担
拆
拇
拈
拉
拊
拋
拌
拍
拎
拐
拒
拓
拔
拖
拗
拘
拙
拚
招
拜
拟
拢
拣
拥
拦
拧
拨
择
括
拭
拮
拯
拱
拳
拴
拶
拷
拼
拽
拾
拿
持
挂
指
挈
按
挎
挑
挖
挚
挛
挝
挞
挟
挠
挡
挣
挤
挥
挨
挪
挫
振
挲
挹
挺
挽
挾
捂
捅
捆
捉
捋
捌
捍
捎
捏
捐
捕
捞
损
捡
换
捣
捧
捩
捫
捭
据
捯
捱
捶
捷
捺
捻
捽
掀
掂
掃
掄
掇
授
掉
掊
掌
掏
掐
排
掖
掘
掙
掛
掠
探
掣
接
控
推
掩
措
掬
掭
掮
掰
掱
掳
掴
掷
掸
掺
掼
揀
揄
揆
揉
揍
揎
描
提
插
揖
揚
換
揠
握
揣
揩
揪
揭
揮
揳
援
揶
揽
揾
揿
搀
搁
搂
搅
搋
搌
損
搏
搐
搓
搔
搖
搗
搛
搜
搞
搠
搡
搦
搪
搬
搭
搴
搵
搶
携
搽
摁
摂
摄
摆
摇
摈
摊
摑
摒
摔
摘
摜
摞
摟
摧
摩
摭
摯
摳
摸
摹
摻
撂
撃
撄
撅
撇
撈
撐
撑
撒
撓
撕
撘
撙
撞
撣
撤
撥
撩
撫
撬
播
撮
撰
撲
撳
撵
撷
撸
撺
撻
撼
撾
撿
擀
擁
擂
擄
擅
擇
擊
擋
操
擎
擐
擒
擔
擗
擘
據
擞
擠
擡
擢
擤
擦
擬
擯
擰
擱
擲
擴
擷
擺
擻
擼
擾
攀
攆
攉
攏
攒
攔
攖
攘
攙
攛
攜
攝
攢
攣
攤
攥
攪
攫
攬
攮
支
收
攸
改
攻
放
政
故
效
敉
敌
敏
救
敕
敖
敗
敘
教
敛
敝
敞
敢
散
敦
敫
敬
数
敲
整
敵
敷
數
斂
斃
文
斉
斋
斌
斎
斐
斑
斓
斕
斗
料
斛
斜
斟
斡
斤
斥
斧
斩
斫
斬
断
斯
新
斱
斷
方
於
施
旁
旄
旅
旆
旋
旌
旎
族
旒
旖
旗
无
既
日
旦
旧
旨
早
旬
旭
旮
旯
旱
旵
时
旷
旸
旺
旻
昀
昂
昆
昇
昉
昊
昌
明
昏
易
昔
昕
昙
昝
星
映
春
昧
昨
昭
是
昱
昴
昵
昶
昼
显
晁
時
晃
晉
晋
晌
晏
晒
晓
晔
晕
晖
晗
晚
晝
晞
晟
晤
晦
晨
晩
普
景
晰
晴
晶
晷
晹
智
晾
暁
暂
暄
暇
暈
暉
暌
暎
暑
暖
暗
暘
暢
暧
暨
暫
暮
暱
暴
暸
暹
暾
曄
曇
曉
曌
曖
曙
曜
曝
曠
曦
曩
曬
曰
曲
曳
更
曷
書
曹
曼
曽
曾
替
最
會
月
有
朋
服
朐
朔
朕
朗
望
朝
期
朦
朧
木
未
末
本
札
术
朱
朴
朵
机
朽
杀
杂
权
杆
杈
杉
李
杏
材
村
杓
杖
杜
杞
束
杠
条
杣
来
杨
杪
杭
杯
杰
東
杲
杳
杴
杵
杷
杼
松
板
枀
极
构
枇
枉
析
枕
林
枘
枚
果
枝
枞
枢
枣
枥
枧
枪
枫
枭
枯
枰
枳
枵
架
枷
枸
柄
柊
柏
某
柑
柒
染
柔
柘
柙
柚
柜
柝
柞
柠
柢
查
柩
柬
柯
柰
柱
柳
柴
柵
柿
栀
栃
栅
标
栈
栉
栊
栋
栌
栎
栏
树
栓
栖
栗
栝
校
栩
株
栲
栳
样
核
根
格
栽
栾
桀
桁
桂
桃
桄
桅
框
案
桉
桌
桎
桐
桑
桓
桔
桕
桠
桡
桢
档
桥
桦
桧
桨
桩
桫
桴
桶
桷
梁
梃
梅
梆
梏
梓
梔
梗
梘
條
梟
梢
梦
梧
梨
梭
梯
械
梳
梵
梶
检
棂
棄
棉
棋
棍
棒
棕
棗
棘
棚
棟
棠
棣
棧
森
棱
棲
棵
棹
棺
椁
椅
植
椎
椏
椒
椟
椠
椤
椭
椰
椴
椹
椽
椿
楂
楊
楓
楔
楚
楝
楞
楠
楣
楦
楨
楫
業
楮
極
楷
楸
楹
楼
概
榄
榆
榇
榈
榉
榊
榔
榕
榘
榛
榜
榤
榧
榨
榫
榭
榮
榴
榷
榻
槁
槃
構
槌
槍
槎
槐
槑
槓
様
槙
槛
槟
槠
槧
槨
槩
槪
槲
槳
槽
槿
樁
樂
樅
樊
樋
樓
樗
樘
標
樞
樟
模
樣
樨
横
樯
樱
樵
樹
樺
樽
樾
橄
橇
橈
橋
橐
橘
橙
橛
機
橡
橢
橦
橫
橱
橹
橼
檀
檁
檄
檐
檔
檜
檠
檢
檣
檩
檫
檬
檳
檸
檻
檾
櫃
櫓
櫚
櫛
櫝
櫞
櫟
櫥
櫧
櫨
櫪
櫬
櫱
櫳
櫸
櫻
欄
權
欏
欒
欖
欞
欠
次
欢
欣
欤
欧
欲
欹
欺
欽
款
歃
歆
歇
歉
歌
歐
歙
歟
歡
止
正
此
步
武
歧
歩
歪
歮
歲
歷
歸
歹
死
歼
歿
殁
殂
殃
殄
殆
殇
殉
殊
残
殍
殒
殓
殖
殘
殚
殛
殞
殡
殤
殪
殫
殭
殮
殯
殲
殳
殴
段
殷
殺
殼
殿
毀
毁
毂
毅
毆
毋
母
毎
每
毑
毒
毓
比
毕
毖
毗
毙
毛
毡
毫
毬
毯
毳
毽
氅
氆
氇
氈
氌
氏
民
氓
气
氖
氙
氛
氟
氡
氢
氣
氤
氦
氧
氨
氩
氪
氫
氬
氮
氯
氰
氲
氳
水
永
氽
氾
汀
汁
求
汆
汇
汉
汊
汎
汏
汐
汕
汗
汙
汛
汝
汞
江
池
污
汤
汨
汩
汪
汰
汲
汴
汶
汹
決
汽
汾
沁
沂
沃
沅
沆
沈
沉
沌
沏
沐
沒
沓
沔
沖
沙
沛
沟
没
沢
沣
沤
沥
沦
沧
沪
沫
沭
沮
沱
沲
河
沸
油
治
沼
沽
沾
沿
況
泄
泅
泇
泉
泊
泌
泐
泓
泔
法
泖
泗
泛
泞
泠
泡
波
泣
泥
注
泪
泫
泮
泯
泰
泱
泳
泵
泷
泸
泻
泼
泽
泾
洁
洄
洇
洋
洌
洒
洗
洙
洛
洞
津
洩
洪
洮
洱
洲
洵
洶
洹
活
洼
洽
派
流
浃
浅
浆
浇
浈
浊
测
济
浏
浐
浑
浒
浓
浔
浙
浚
浜
浞
浠
浣
浦
浩
浪
浮
浯
浴
浵
海
浸
浹
涂
涅
涇
消
涉
涌
涎
涓
涕
涛
涝
涞
涟
涠
涡
涣
涤
润
涧
涨
涩
涪
涮
涯
液
涵
涸
涼
涿
淀
淄
淅
淆
淇
淋
淌
淑
淒
淖
淘
淙
淚
淝
淞
淡
淤
淥
淦
淨
淪
淫
淬
淮
深
淳
淵
淶
混
淹
淺
添
淼
清
済
渉
渊
渌
渍
渎
渐
渑
渔
渗
渙
渚
減
渝
渟
渠
渡
渣
渤
渥
渦
温
測
渭
港
渲
渴
游
渺
渾
湃
湄
湉
湊
湍
湎
湔
湖
湘
湛
湞
湟
湧
湫
湮
湯
湴
湾
湿
溃
溅
溆
溉
溏
源
準
溘
溜
溝
溟
溢
溥
溧
溪
溫
溯
溱
溲
溴
溶
溺
溻
溼
溽
滁
滂
滄
滅
滇
滋
滌
滎
滏
滑
滓
滔
滕
滘
滚
滞
滟
滠
满
滢
滤
滥
滦
滨
滩
滬
滯
滲
滴
滸
滹
滻
滾
滿
漁
漂
漆
漈
漉
漏
漓
演
漕
漚
漠
漢
漣
漤
漩
漪
漫
漬
漯
漱
漲
漳
漵
漸
漾
漿
潁
潇
潋
潍
潑
潔
潘
潛
潜
潞
潟
潢
潤
潦
潭
潮
潯
潰
潲
潴
潸
潺
潼
潿
澀
澄
澆
澇
澈
澌
澍
澎
澗
澜
澠
澡
澤
澧
澳
澶
激
濁
濂
濃
濉
濑
濒
濘
濛
濟
濠
濡
濤
濫
濮
濯
濰
濱
濺
濾
瀅
瀆
瀉
瀏
瀑
瀕
瀘
瀚
瀛
瀝
瀟
瀣
瀦
瀧
瀨
瀬
瀲
瀹
瀾
灃
灄
灌
灏
灑
灘
灝
灞
灠
灣
灤
灩
火
灬
灭
灯
灰
灵
灶
灸
灼
災
灾
灿
炀
炅
炆
炉
炊
炎
炒
炔
炕
炖
炘
炙
炜
炝
炫
炬
炭
炮
炯
炳
炷
炸
点
為
炼
炽
烀
烁
烂
烃
烈
烊
烏
烘
烙
烛
烟
烤
烦
烧
烨
烩
烫
烬
热
烯
烴
烷
烹
烽
焉
焊
焐
焓
焕
焖
焗
焘
焙
焚
焜
無
焦
焯
焰
焱
然
煅
煉
煊
煌
煎
煒
煙
煜
煞
煤
煥
煦
照
煨
煩
煬
煮
煲
煳
煸
煽
熄
熊
熏
熒
熔
熗
熘
熙
熟
熠
熨
熬
熱
熹
熾
燁
燃
燈
燉
燊
燎
燒
燔
燕
燙
燜
營
燠
燥
燦
燧
燭
燮
燴
燹
燼
燾
爆
爍
爐
爛
爪
爬
爭
爰
爱
爲
爵
父
爷
爸
爹
爺
爻
爽
爾
爿
牀
牆
片
版
牌
牍
牒
牖
牘
牙
牛
牝
牟
牠
牡
牢
牦
牧
物
牯
牲
牵
特
牺
牽
牾
犀
犁
犄
犇
犊
犍
犏
犒
犖
犛
犟
犢
犧
犬
犯
犰
犴
状
犷
犸
犹
狀
狂
狄
狈
狍
狎
狐
狒
狗
狙
狞
狠
狡
狩
独
狭
狮
狯
狰
狱
狲
狳
狷
狸
狹
狼
狽
猁
猃
猄
猇
猎
猕
猖
猗
猙
猛
猜
猝
猞
猡
猢
猥
猩
猪
猫
猬
献
猴
猶
猷
猸
猻
猾
猿
獁
獄
獅
獎
獐
獒
獗
獠
獨
獪
獫
獭
獰
獲
獴
獵
獷
獸
獺
獻
獼
獾
玀
玄
率
玉
王
玍
玎
玑
玒
玖
玛
玟
玢
玥
玦
玩
玫
玮
环
现
玲
玳
玷
玺
玻
珀
珂
珅
珈
珉
珊
珍
珏
珐
珑
珙
珜
珞
珠
珣
珥
珧
珩
班
珮
珲
珹
珺
現
球
琅
理
琉
琊
琍
琎
琏
琐
琚
琛
琢
琤
琥
琦
琨
琪
琬
琮
琰
琳
琴
琵
琶
琺
琼
琿
瑁
瑄
瑋
瑕
瑗
瑙
瑚
瑛
瑜
瑞
瑟
瑣
瑤
瑩
瑪
瑰
瑶
瑷
瑾
璀
璃
璇
璈
璉
璋
璎
璐
璜
璞
璟
璠
璡
璣
璦
璧
璨
環
璺
璽
瓊
瓏
瓒
瓔
瓚
瓜
瓞
瓢
瓣
瓤
瓦
瓩
瓮
瓯
瓴
瓶
瓷
瓿
甄
甌
甏
甑
甓
甕
甘
甙
甚
甜
生
產
産
甥
甦
用
甩
甪
甫
甬
甭
甯
田
由
甲
申
电
男
甸
町
画
畅
畈
畊
畋
界
畏
畑
畔
留
畚
畛
畜
畝
畠
畢
略
畦
番
畫
畬
異
畲
畴
當
畸
畾
畿
疃
疆
疇
疊
疍
疏
疑
疔
疖
疗
疙
疚
疝
疟
疠
疡
疣
疤
疥
疫
疬
疮
疯
疰
疱
疲
疳
疴
疵
疸
疹
疼
疽
疾
痂
痄
病
症
痈
痉
痊
痍
痒
痔
痕
痖
痘
痙
痛
痞
痢
痣
痤
痦
痧
痨
痪
痫
痰
痱
痴
痹
痺
痼
痾
痿
瘀
瘁
瘂
瘅
瘆
瘊
瘋
瘌
瘍
瘐
瘓
瘗
瘘
瘙
瘛
瘞
瘟
瘠
瘡
瘢
瘤
瘦
瘧
瘩
瘪
瘫
瘮
瘰
瘴
瘸
瘻
瘼
瘾
瘿
癀
療
癃
癆
癇
癉
癌
癍
癒
癔
癖
癘
癜
癞
癟
癡
癢
癣
癤
癧
癩
癫
癬
癭
癮
癯
癰
癱
癲
癸
登
發
白
百
癿
皂
的
皆
皇
皈
皋
皎
皑
皓
皖
皙
皚
皛
皮
皰
皱
皲
皴
皸
皺
皿
盂
盅
盆
盈
益
盍
盎
盏
盐
监
盒
盔
盖
盗
盘
盛
盜
盞
盟
盡
監
盤
盥
盧
盪
目
盯
盱
盲
直
相
盹
盼
盾
省
眄
眇
眈
眉
看
県
眍
眙
眚
眞
真
眠
眥
眦
眨
眩
眭
眯
眵
眶
眷
眸
眺
眼
眾
着
睁
睃
睇
睐
睑
睚
睛
睜
睞
睡
睢
督
睥
睦
睨
睪
睫
睬
睹
睽
睾
睿
瞄
瞅
瞌
瞍
瞎
瞑
瞒
瞘
瞞
瞟
瞠
瞥
瞧
瞩
瞪
瞬
瞭
瞰
瞳
瞻
瞼
瞿
矇
矍
矗
矚
矛
矜
矢
矣
知
矩
矫
矬
短
矮
矯
石
矶
矸
矻
矽
矾
矿
砀
码
砂
砉
砌
砍
砒
研
砖
砘
砚
砝
砟
砣
砥
砦
砧
砭
砰
砲
砳
破
砷
砸
砺
砻
砼
砾
础
硅
硌
硎
硒
硕
硗
硚
硝
硫
硬
确
硯
硼
碁
碇
碉
碌
碍
碎
碑
碓
碗
碘
碚
碛
碜
碟
碡
碣
碧
碩
碭
碰
碱
碳
碴
確
碼
碾
磁
磅
磊
磋
磐
磔
磕
磙
磚
磣
磧
磨
磬
磯
磴
磷
磺
磽
礁
礄
礎
礓
礙
礦
礪
礫
礬
礱
礴
示
礼
礽
社
祀
祁
祈
祉
祎
祐
祕
祖
祗
祚
祛
祜
祝
神
祟
祠
祤
祥
祧
票
祭
祯
祷
祸
祺
祼
祿
禀
禁
禄
禅
禍
禎
福
禕
禧
禪
禮
禱
禳
禹
禺
离
禽
禾
禿
秀
私
秃
秆
秈
秉
秋
种
科
秒
秕
秘
租
秣
秤
秦
秧
秩
秫
秭
积
称
秸
移
秽
稀
稂
稃
稅
稈
程
稍
税
稔
稗
稚
稜
稞
稟
稠
稣
種
稱
稲
稳
稷
稹
稻
稼
稽
稿
穀
穆
穌
積
穎
穑
穗
穡
穢
穩
穰
穴
究
穷
穸
穹
空
穿
窀
突
窃
窄
窈
窍
窑
窒
窕
窖
窗
窘
窜
窝
窟
窠
窥
窦
窨
窩
窪
窬
窮
窯
窳
窺
窿
竄
竅
竇
竈
竊
立
竖
站
竞
竟
章
竣
童
竭
端
竲
競
竹
竺
竽
竿
笃
笄
笆
笈
笊
笋
笏
笑
笔
笕
笙
笛
笞
笠
笤
笥
符
笨
笪
笫
第
笮
笳
笸
笺
笼
筆
筇
等
筋
筌
筍
筏
筐
筑
筒
答
策
筘
筚
筛
筝
筠
筢
筧
筮
筱
筲
筵
筷
筹
签
简
箅
箋
箍
箏
箐
箔
箕
箖
算
箜
管
箢
箧
箩
箪
箫
箬
箭
箱
箴
節
篁
篆
篇
築
篋
篌
篑
篓
篙
篝
篠
篡
篤
篦
篩
篪
篮
篱
篳
篷
篾
簇
簋
簌
簍
簏
簞
簟
簡
簣
簧
簪
簫
簷
簸
簽
簾
簿
籀
籁
籃
籌
籍
籟
籠
籤
籬
籮
米
类
籼
籽
粉
粑
粒
粕
粗
粘
粜
粝
粞
粟
粤
粥
粪
粮
粱
粲
粳
粵
粹
粼
粽
精
糁
糅
糇
糉
糊
糌
糍
糕
糖
糗
糙
糜
糝
糞
糟
糠
糧
糨
糯
糲
糶
系
糾
紀
紂
約
紅
紇
紈
紉
紊
紋
納
紐
紓
純
紕
紗
紘
紙
級
紛
紜
素
紡
索
紧
紫
紬
累
細
紱
紲
紳
紹
紺
紼
絀
終
組
絆
絎
結
絕
絛
絝
絞
絡
絢
給
絨
絮
統
絲
絳
絵
絷
絹
綁
綃
綈
綏
經
綜
綠
綢
綣
綦
綬
維
綰
綱
網
綴
綸
綹
綺
綻
綽
綾
綿
緄
緇
緊
緋
総
緑
緒
緗
緘
緙
線
緝
緞
締
緡
緣
緦
編
緩
緬
緯
緲
練
緶
緹
縈
縉
縊
縐
縑
縛
縝
縞
縟
縣
縫
縮
縱
縶
縷
縹
總
績
繁
繃
繅
繆
繇
繒
織
繕
繚
繞
繡
繩
繪
繭
繮
繰
繳
繹
繼
繽
繾
纂
續
纏
纓
纖
纜
纠
红
纣
纤
纥
约
级
纨
纪
纫
纬
纭
纮
纯
纰
纱
纲
纳
纵
纶
纷
纸
纹
纺
纽
纾
线
绀
绁
绂
练
组
绅
细
织
终
绉
绊
绋
绌
绍
绎
经
绑
绒
结
绔
绕
绗
绘
给
绚
绛
络
绝
绞
统
绡
绢
绣
绥
绦
继
绨
绩
绪
绫
续
绮
绯
绰
绲
绳
维
绵
绶
绷
绸
绺
绻
综
绽
绾
绿
缀
缁
缂
缃
缄
缅
缆
缇
缈
缉
缌
缎
缏
缓
缔
缕
编
缗
缘
缙
缚
缛
缜
缝
缟
缠
缢
缣
缤
缥
缨
缩
缪
缫
缭
缮
缯
缰
缱
缲
缴
缶
缸
缺
罂
罄
罅
罌
罍
罐
网
罔
罕
罗
罘
罚
罟
罡
罢
罨
罩
罪
置
罰
罱
署
罴
罵
罷
罹
罾
羁
羅
羆
羈
羊
羋
羌
美
羑
羔
羕
羚
羝
羞
羟
羡
羣
群
羥
羨
義
羯
羲
羴
羸
羹
羽
羿
翀
翁
翃
翅
翊
翌
翎
習
翔
翕
翘
翟
翠
翡
翥
翦
翩
翮
翰
翱
翳
翹
翻
翼
耀
老
考
耄
者
耆
耋
而
耍
耐
耒
耔
耕
耗
耘
耙
耠
耢
耥
耦
耧
耨
耩
耪
耬
耮
耱
耳
耵
耶
耷
耸
耻
耽
耿
聂
聆
聊
聋
职
聍
聒
联
聖
聘
聚
聞
聡
聩
聪
聯
聰
聲
聳
聴
聵
聶
職
聹
聽
聾
聿
肃
肄
肅
肆
肇
肉
肋
肌
肓
肖
肘
肚
肛
肝
肠
股
肢
肤
肥
肩
肪
肫
肭
肮
肯
肱
育
肴
肺
肼
肽
肾
肿
胀
胁
胂
胃
胄
胆
背
胎
胖
胗
胚
胛
胜
胝
胞
胡
胤
胥
胧
胨
胪
胫
胭
胯
胰
胱
胳
胴
胶
胸
胺
胼
能
脂
脅
脆
脇
脈
脉
脊
脍
脏
脐
脑
脓
脔
脖
脘
脚
脛
脣
脫
脯
脱
脲
脶
脸
脹
脾
腆
腈
腊
腋
腌
腎
腐
腑
腓
腔
腕
腖
腚
腠
腡
腥
腦
腧
腩
腫
腭
腮
腰
腱
腳
腴
腸
腹
腺
腻
腼
腽
腾
腿
膀
膂
膃
膈
膊
膏
膑
膓
膘
膚
膛
膜
膝
膠
膣
膦
膨
膩
膳
膺
膻
膽
膾
膿
臀
臂
臃
臆
臉
臊
臌
臍
臏
臘
臚
臟
臠
臣
臥
臧
臨
自
臬
臭
至
致
臻
臼
臾
舀
舁
舂
舄
舅
舆
與
興
舉
舊
舌
舍
舐
舒
舔
舙
舛
舜
舞
舟
舡
舢
航
舫
般
舰
舱
舴
舵
舶
舷
舸
船
舾
艄
艇
艋
艏
艘
艙
艟
艦
艨
艮
良
艰
艱
色
艳
艷
艸
艹
艺
艾
艿
节
芃
芈
芊
芋
芍
芎
芑
芒
芔
芗
芙
芜
芝
芟
芡
芤
芥
芦
芨
芩
芪
芫
芬
芭
芮
芯
芰
花
芳
芴
芶
芷
芸
芹
芻
芽
芾
苁
苇
苋
苌
苍
苎
苏
苑
苒
苓
苔
苕
苗
苘
苛
苜
苞
苟
苡
苣
苤
若
苦
苧
苫
苯
英
苴
苷
苹
苻
茁
茂
范
茄
茅
茆
茉
茌
茎
茏
茔
茗
茜
茧
茨
茫
茬
茭
茯
茱
茲
茴
茵
茶
茸
茹
茻
茼
荀
荃
荆
草
荊
荏
荐
荑
荒
荔
荚
荛
荜
荞
荟
荠
荡
荣
荤
荥
荦
荧
荨
荩
荪
荫
荮
药
荷
荸
荻
荼
荽
莅
莆
莉
莊
莎
莒
莓
莖
莘
莛
莜
莞
莠
莢
莧
莨
莩
莪
莫
莱
莲
莳
莴
获
莸
莹
莺
莼
莽
菀
菁
菅
菇
菈
菊
菌
菏
菓
菔
菖
菘
菜
菟
菠
菡
菩
菪
華
菰
菱
菲
菻
菽
萁
萃
萄
萇
萊
萋
萌
萍
萎
萝
萤
营
萦
萧
萨
萩
萬
萱
萵
萸
萼
落
葆
葉
葑
著
葙
葚
葛
葡
董
葤
葦
葩
葫
葬
葭
葱
葳
葵
葷
葸
葹
葺
蒂
蒇
蒋
蒐
蒔
蒙
蒜
蒞
蒡
蒨
蒯
蒲
蒴
蒸
蒺
蒼
蒽
蒿
蓀
蓁
蓄
蓆
蓉
蓊
蓋
蓐
蓑
蓓
蓖
蓝
蓟
蓠
蓥
蓦
蓬
蓮
蓯
蓴
蓶
蓼
蓽
蓿
蔑
蔓
蔗
蔚
蔟
蔡
蔣
蔥
蔦
蔫
蔬
蔭
蔷
蔸
蔺
蔻
蔼
蔽
蕁
蕃
蕆
蕈
蕉
蕊
蕎
蕕
蕘
蕙
蕞
蕤
蕨
蕪
蕭
蕲
蕴
蕺
蕻
蕾
薄
薅
薇
薈
薊
薌
薏
薔
薛
薜
薦
薨
薩
薪
薫
薮
薯
薰
薷
薹
薺
藁
藉
藍
藎
藏
藐
藓
藕
藜
藝
藤
藥
藩
藪
藹
藺
藻
藿
蘄
蘅
蘆
蘇
蘊
蘋
蘑
蘖
蘚
蘢
蘧
蘩
蘭
蘸
蘺
蘼
蘿
虎
虏
虐
虑
虔
處
虚
虛
虜
虞
號
虢
虧
虫
虬
虯
虱
虹
虺
虻
虼
虽
虾
虿
蚀
蚁
蚂
蚊
蚌
蚍
蚓
蚕
蚜
蚝
蚣
蚤
蚧
蚨
蚩
蚪
蚬
蚯
蚰
蚱
蚴
蚵
蚶
蚺
蛀
蛄
蛆
蛇
蛉
蛊
蛋
蛎
蛏
蛐
蛑
蛔
蛙
蛛
蛞
蛟
蛤
蛭
蛮
蛰
蛱
蛲
蛳
蛴
蛹
蛺
蛻
蛾
蜀
蜂
蜃
蜆
蜇
蜈
蜉
蜊
蜍
蜒
蜓
蜕
蜗
蜘
蜚
蜜
蜡
蜢
蜥
蜩
蜮
蜱
蜴
蜷
蜻
蜿
蝇
蝈
蝉
蝌
蝎
蝓
蝕
蝗
蝙
蝟
蝠
蝣
蝤
蝦
蝨
蝮
蝰
蝴
蝶
蝸
蝻
蝼
蝾
螂
螃
螄
螅
螈
融
螗
螞
螟
螢
螨
螫
螬
螯
螳
螺
螻
蟀
蟄
蟆
蟈
蟊
蟋
蟎
蟑
蟒
蟠
蟥
蟬
蟮
蟯
蟲
蟶
蟹
蟻
蟾
蠅
蠆
蠊
蠍
蠐
蠑
蠓
蠕
蠖
蠟
蠡
蠢
蠣
蠱
蠲
蠶
蠹
蠻
血
衄
衅
衆
行
衍
術
衔
街
衙
衛
衝
衡
衢
衣
补
表
衩
衫
衬
衮
衰
衲
衷
衽
衾
衿
袁
袂
袄
袅
袈
袋
袍
袒
袖
袜
袞
袢
袤
袪
被
袭
袱
袷
裁
裂
装
裆
裊
裎
裏
裒
裔
裕
裘
裙
補
裝
裟
裡
裢
裣
裤
裥
裨
裰
裱
裳
裴
裸
裹
製
裾
褂
褊
褐
褒
褓
褙
褚
褛
褡
褥
褪
褫
褰
褲
褳
褴
褶
褸
褻
襁
襄
襉
襖
襝
襞
襟
襠
襤
襪
襯
襲
襻
西
要
覃
覆
見
規
覓
視
覘
覦
親
覬
覯
覲
覷
覺
覽
觀
见
观
规
觅
视
觇
览
觉
觊
觎
觏
觐
觑
角
觚
觜
觞
解
觥
触
觴
觸
言
訂
訃
訇
計
訊
訌
討
訐
訓
訕
訖
託
記
訛
訝
訟
訣
訥
訪
設
許
訴
訶
診
訾
詁
詆
詈
詐
詔
評
詘
詛
詞
詠
詡
詢
詣
試
詩
詫
詬
詭
詮
詰
話
該
詳
詹
詼
詿
誄
誅
誆
誉
誊
認
誑
誒
誓
誕
誘
誚
語
誠
誡
誣
誤
誥
誦
誨
說
誰
課
誹
誼
調
諂
諄
談
諉
請
諍
諏
諑
諒
論
諗
諛
諜
諞
諡
諢
諤
諦
諧
諫
諭
諮
諱
諳
諶
諷
諸
諺
諾
謀
謁
謂
謄
謅
謇
謊
謎
謐
謔
謖
謗
謙
講
謝
謠
謨
謫
謬
謳
謹
謾
謿
證
譎
譏
識
譙
譚
譜
警
譫
譬
譯
議
譴
護
譽
譾
譿
讀
讉
變
讒
讓
讕
讖
讜
计
订
讣
认
讥
讦
讧
讨
让
讪
讫
训
议
讯
记
讲
讳
讴
讶
讷
许
讹
论
讼
讽
设
访
诀
证
诂
诃
评
诅
识
诈
诉
诊
诋
诌
词
诎
诏
译
诓
诔
试
诖
诗
诘
诙
诚
诛
话
诞
诟
诠
诡
询
诣
诤
该
详
诧
诨
诩
诫
诬
语
诮
误
诰
诱
诲
诳
说
诵
诶
请
诸
诹
诺
读
诼
诽
课
诿
谀
谁
谂
调
谄
谅
谆
谈
谊
谋
谌
谍
谎
谏
谐
谑
谒
谓
谔
谕
谗
谘
谙
谚
谛
谜
谝
谟
谠
谡
谢
谣
谤
谥
谦
谧
谨
谩
谪
谫
谬
谭
谯
谰
谱
谲
谴
谵
谶
谷
豁
豆
豇
豈
豉
豊
豌
豎
豐
豕
豚
象
豢
豪
豫
豬
豹
豺
貂
貅
貉
貌
貍
貓
貔
貘
貝
貞
貟
負
財
貢
貧
貨
販
貪
貫
責
貯
貰
貲
貳
貴
貶
買
貸
貺
費
貼
貽
貿
賀
賁
賂
賃
賄
賅
資
賈
賊
賑
賒
賓
賚
賜
賞
賠
賡
賢
賣
賤
賦
質
賭
賴
賺
賻
購
賽
賾
贅
贇
贈
贊
贍
贏
贓
贔
贖
贗
贛
贝
贞
负
贠
贡
财
责
贤
败
账
货
质
贩
贪
贫
贬
购
贮
贯
贰
贱
贲
贳
贴
贵
贶
贷
贸
费
贺
贻
贼
贾
贿
赀
赁
赂
赃
资
赅
赈
赉
赊
赋
赌
赍
赎
赏
赐
赑
赓
赔
赖
赘
赙
赚
赛
赜
赝
赞
赟
赠
赡
赢
赣
赤
赦
赧
赫
赭
走
赳
赴
赵
赶
起
趁
趄
超
越
趋
趑
趔
趕
趙
趟
趣
趨
趱
趲
足
趴
趵
趸
趺
趼
趾
趿
跃
跄
跆
跋
跌
跎
跏
跑
跖
跗
跚
跛
距
跞
跟
跡
跣
跤
跨
跪
跫
路
跳
践
跶
跷
跸
跹
跺
跻
跽
踅
踉
踊
踌
踏
踐
踔
踝
踞
踟
踢
踣
踩
踪
踬
踭
踮
踯
踱
踴
踵
踹
踺
踽
蹀
蹂
蹄
蹇
蹈
蹉
蹊
蹋
蹌
蹑
蹒
蹓
蹕
蹙
蹚
蹣
蹤
蹦
蹩
蹬
蹭
蹯
蹰
蹲
蹴
蹶
蹺
蹼
蹿
躁
躂
躅
躇
躉
躊
躋
躍
躏
躐
躑
躒
躓
躕
躚
躞
躡
躥
躪
身
躬
躯
躲
躺
軀
車
軋
軌
軍
軏
軒
軔
軛
軟
軤
軫
軲
軸
軻
軼
軾
較
輅
載
輒
輔
輕
輗
輛
輜
輝
輟
輥
輦
輩
輪
輯
輸
輻
輾
輿
轂
轄
轅
轆
轉
轍
轎
轟
轡
轤
车
轧
轨
轩
轫
转
轭
轮
软
轰
轱
轲
轳
轴
轶
轷
轸
轻
轼
载
轿
辂
较
辄
辅
辆
辇
辈
辉
辊
辍
辎
辐
辑
输
辔
辕
辖
辗
辘
辙
辛
辜
辞
辟
辣
辦
辨
辩
辫
辭
辮
辯
辰
辱
農
边
辺
辻
辽
达
辿
迁
迂
迄
迅
过
迈
迎
运
近
迓
返
迕
还
这
迚
进
远
违
连
迟
迢
迤
迥
迦
迨
迩
迪
迫
迭
述
迳
迴
迷
迸
迹
追
退
送
适
逃
逄
逅
逆
选
逊
逋
逍
透
逐
逑
递
途
逕
逖
逗
這
通
逛
逝
逞
速
造
逡
逢
連
逦
逭
逮
逯
週
進
逵
逶
逸
逺
逻
逼
逾
遁
遂
遄
遇
遊
運
遍
過
遏
遐
遑
遒
道
達
違
遗
遙
遛
遜
遞
遠
遢
遣
遥
遨
適
遭
遮
遲
遴
遵
遷
選
遺
遼
遽
避
邀
邁
邂
邃
還
邇
邈
邊
邋
邏
邐
邑
邓
邕
邗
邛
邝
邡
邢
那
邦
邨
邪
邬
邮
邯
邰
邱
邳
邵
邸
邹
邺
邻
郁
郄
郅
郊
郎
郏
郐
郑
郓
郗
郚
郜
郝
郟
郡
郢
郦
郧
部
郫
郭
郯
郴
郵
郸
都
鄂
鄄
鄆
鄉
鄌
鄒
鄔
鄖
鄙
鄞
鄠
鄢
鄧
鄭
鄯
鄰
鄱
鄲
鄴
鄶
鄺
酈
酉
酊
酋
酌
配
酏
酐
酒
酗
酚
酝
酞
酡
酢
酣
酤
酥
酩
酪
酬
酮
酯
酰
酱
酵
酶
酷
酸
酹
酽
酾
酿
醃
醇
醉
醋
醍
醐
醑
醒
醚
醛
醞
醢
醪
醫
醬
醭
醮
醯
醴
醺
釀
釁
釃
釅
采
釉
释
釋
里
重
野
量
金
釔
釕
釗
釘
釙
釜
針
釣
釤
釧
釩
釵
釷
釹
釺
鈀
鈉
鈍
鈐
鈑
鈔
鈕
鈞
鈣
鈥
鈦
鈮
鈰
鈴
鈷
鈸
鈹
鈺
鈽
鈾
鈿
鉀
鉅
鉈
鉉
鉑
鉗
鉚
鉛
鉞
鉢
鉤
鉦
鉬
鉭
鉳
鉴
鉸
鉻
鉾
銀
銃
銅
銍
銑
銓
銖
銘
銚
銜
銣
銥
銦
銨
銫
銬
銮
銱
銳
銷
銻
銼
鋁
鋃
鋅
鋆
鋇
鋈
鋌
鋏
鋒
鋟
鋤
鋥
鋪
鋮
鋯
鋰
鋸
鋼
錁
錄
錐
錕
錘
錙
錚
錛
錠
錢
錤
錦
錨
錫
錮
錯
錳
錾
鍇
鍋
鍍
鍔
鍘
鍛
鍤
鍥
鍩
鍬
鍵
鍶
鍺
鍾
鎂
鎊
鎏
鎔
鎖
鎘
鎢
鎣
鎦
鎧
鎩
鎪
鎬
鎮
鎯
鎰
鎳
鎵
鏃
鏈
鏊
鏐
鏑
鏖
鏗
鏘
鏜
鏞
鏟
鏡
鏢
鏤
鏨
鏰
鏵
鏹
鏽
鐃
鐋
鐏
鐐
鐘
鐙
鐠
鐧
鐫
鐮
鐲
鐳
鐵
鐸
鐺
鐾
鑄
鑊
鑌
鑑
鑒
鑔
鑠
鑣
鑫
鑰
鑲
鑷
鑹
鑼
鑽
鑾
鑿
钁
钇
针
钉
钊
钋
钌
钍
钎
钏
钐
钒
钓
钕
钗
钙
钚
钛
钜
钝
钞
钟
钠
钡
钢
钣
钤
钥
钦
钧
钨
钩
钬
钮
钯
钰
钱
钲
钳
钴
钵
钹
钺
钻
钼
钽
钾
钿
铀
铁
铂
铃
铄
铅
铆
铈
铉
铊
铌
铍
铎
铐
铖
铗
铙
铚
铛
铜
铝
铞
铟
铠
铡
铢
铣
铤
铧
铨
铩
铫
铬
铭
铮
铯
铰
铱
铲
铳
铴
铵
银
铷
铸
铺
链
铿
销
锁
锂
锃
锄
锅
锆
锈
锉
锋
锌
锏
锐
锑
锒
锓
锗
锘
错
锚
锛
锞
锟
锡
锢
锣
锤
锥
锦
锨
锫
锭
键
锯
锰
锱
锲
锴
锵
锶
锷
锸
锹
锺
锻
锼
镀
镁
镂
镇
镉
镊
镌
镍
镏
镐
镑
镒
镓
镔
镕
镖
镗
镚
镛
镜
镝
镞
镠
镢
镣
镨
镩
镪
镫
镬
镭
镯
镰
镲
镳
镶
長
长
門
閂
閃
閆
閉
開
閎
閏
閒
間
閔
閘
閡
閣
閥
閨
閩
閫
閬
閭
閱
閹
閻
閽
閾
闃
闆
闇
闈
闊
闋
闌
闐
闔
闕
闖
關
闞
闡
闥
门
闩
闪
闫
闭
问
闯
闰
闱
闲
闳
间
闵
闷
闸
闹
闺
闻
闼
闽
闾
阀
阁
阂
阃
阄
阅
阆
阈
阉
阋
阍
阎
阐
阑
阒
阔
阕
阖
阗
阙
阚
阜
队
阡
阪
阮
阱
防
阳
阴
阵
阶
阻
阿
陀
陂
附
际
陆
陇
陈
陉
陋
陌
降
限
陕
陘
陛
陝
陞
陟
陡
院
陣
除
陨
险
陪
陬
陰
陲
陳
陵
陶
陷
陸
陽
隅
隆
隈
隊
隋
隍
階
随
隐
隔
隕
隗
隘
隙
際
障
隧
隨
險
隱
隴
隶
隸
隻
隼
隽
难
雀
雁
雄
雅
集
雇
雉
雋
雌
雍
雎
雏
雒
雕
雖
雙
雛
雜
雞
離
難
雨
雪
雯
雲
雳
零
雷
雹
電
雾
需
霁
霄
霆
震
霈
霉
霍
霎
霏
霑
霓
霖
霜
霞
霧
霪
霭
霰
露
霸
霹
霽
霾
靂
靄
靈
青
靓
靖
静
靚
靛
靜
非
靠
靡
面
靥
靦
靨
革
靳
靴
靶
靼
鞅
鞋
鞍
鞏
鞑
鞘
鞠
鞣
鞫
鞭
鞲
鞴
韃
韋
韌
韓
韙
韜
韝
韞
韦
韧
韩
韪
韫
韬
韭
音
韵
韶
韻
響
頁
頂
頃
項
順
頇
須
頊
頌
頎
頏
預
頑
頒
頓
頔
頗
領
頜
頡
頤
頦
頭
頰
頷
頸
頹
頻
顆
題
額
顎
顏
顒
願
顙
顛
類
顢
顥
顧
顫
顯
顰
顱
顳
顴
页
顶
顷
顸
项
顺
须
顼
顽
顾
顿
颀
颁
颂
颃
预
颅
领
颇
颈
颉
颊
颌
颍
颏
颐
频
颓
颔
颖
颗
题
颙
颚
颜
额
颞
颟
颠
颡
颢
颤
颦
颧
風
颯
颶
颻
颼
飄
飆
飈
飍
风
飒
飓
飕
飖
飘
飙
飚
飛
飝
飞
食
飢
飥
飧
飨
飩
飪
飭
飯
飲
飴
飼
飽
飾
餘
餚
餛
餜
餞
餡
館
餮
餱
餳
餵
餷
餼
餾
餿
饃
饅
饈
饉
饊
饋
饌
饒
饕
饗
饞
饢
饥
饦
饧
饨
饩
饪
饬
饭
饮
饯
饰
饱
饲
饴
饵
饶
饷
饸
饹
饺
饼
饽
饿
馀
馁
馃
馄
馅
馆
馇
馈
馊
馋
馍
馏
馐
馑
馒
馓
馔
馕
首
馗
香
馥
馨
馫
馬
馭
馮
馱
馳
馴
駁
駅
駐
駑
駒
駔
駕
駘
駙
駛
駝
駟
駢
駭
駱
駿
騁
騅
騍
騎
騏
騖
騙
騤
騫
騭
騮
騰
騶
騷
騸
騾
驀
驁
驂
驃
驄
驅
驊
驌
驍
驕
驗
驚
驛
驟
驢
驤
驥
驪
驫
马
驭
驮
驯
驰
驱
驳
驴
驵
驶
驷
驸
驹
驺
驻
驼
驽
驾
驿
骀
骁
骂
骄
骅
骆
骇
骈
骉
骊
骋
验
骏
骐
骑
骒
骓
骖
骗
骘
骙
骚
骛
骜
骝
骞
骟
骠
骡
骢
骤
骥
骧
骨
骯
骰
骱
骶
骷
骸
骺
骼
髀
髁
髂
髅
髋
髌
髏
髑
髒
髓
體
髕
髖
高
髦
髫
髯
髹
髻
鬃
鬄
鬏
鬓
鬟
鬢
鬣
鬧
鬩
鬮
鬲
鬻
鬼
魁
魂
魃
魄
魅
魇
魈
魉
魍
魎
魏
魑
魔
魘
魚
魯
魷
鮁
鮃
鮋
鮎
鮑
鮒
鮟
鮪
鮫
鮭
鮮
鯁
鯇
鯉
鯊
鯗
鯛
鯡
鯢
鯤
鯧
鯨
鯪
鯽
鯿
鰉
鰍
鰒
鰓
鰣
鰥
鰨
鰩
鰭
鰱
鰲
鰳
鰵
鰻
鰾
鱅
鱇
鱈
鱉
鱒
鱔
鱖
鱗
鱘
鱟
鱤
鱧
鱭
鱷
鱸
鱺
鱻
鱼
鱿
鲁
鲅
鲆
鲇
鲈
鲉
鲋
鲍
鲎
鲑
鲔
鲚
鲛
鲜
鲞
鲟
鲠
鲡
鲢
鲤
鲥
鲨
鲩
鲫
鲮
鲱
鲲
鲳
鲵
鲶
鲷
鲸
鳃
鳄
鳅
鳆
鳇
鳊
鳌
鳍
鳎
鳏
鳐
鳓
鳔
鳕
鳖
鳗
鳘
鳙
鳜
鳝
鳞
鳟
鳢
鳥
鳧
鳩
鳯
鳳
鳴
鳶
鴆
鴇
鴉
鴒
鴕
鴛
鴝
鴞
鴟
鴣
鴦
鴨
鴰
鴻
鴿
鵂
鵑
鵒
鵓
鵜
鵝
鵠
鵡
鵪
鵬
鵲
鶇
鶉
鶘
鶚
鶤
鶩
鶯
鶴
鶻
鶿
鷂
鷓
鷗
鷙
鷚
鷥
鷯
鷲
鷳
鷸
鷹
鷺
鸌
鸕
鸚
鸛
鸝
鸞
鸟
鸠
鸡
鸢
鸣
鸥
鸦
鸨
鸩
鸪
鸫
鸬
鸭
鸮
鸯
鸰
鸱
鸲
鸳
鸵
鸶
鸷
鸹
鸺
鸽
鸾
鸿
鹁
鹂
鹃
鹄
鹅
鹆
鹇
鹈
鹉
鹊
鹌
鹏
鹑
鹕
鹗
鹘
鹚
鹜
鹞
鹤
鹦
鹧
鹨
鹩
鹫
鹬
鹭
鹮
鹰
鹱
鹳
鹵
鹺
鹼
鹽
鹾
鹿
麂
麇
麈
麋
麒
麓
麗
麝
麟
麤
麥
麦
麩
麵
麸
麻
麼
麽
麾
麿
黃
黄
黇
黉
黌
黍
黎
黏
黑
黒
黔
默
黛
黜
黝
點
黟
黠
黢
黥
黧
黨
黩
黯
黴
黷
黿
鼋
鼎
鼐
鼓
鼠
鼢
鼬
鼯
鼴
鼷
鼹
鼻
鼾
齊
齋
齎
齏
齐
齑
齒
齙
齜
齟
齡
齦
齧
齪
齬
齲
齶
齷
齿
龃
龄
龅
龇
龈
龉
龊
龋
龌
龍
龐
龑
龔
龕
龘
龙
龚
龛
龜
龟
龠